Revit 2024 API
HorizontalCurveType Enumeration
 Represents the curve types for the horizontal curves which define Alignment geometry.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public enum HorizontalCurveType
Visual Basic
Public Enumeration HorizontalCurveType
Visual C++
public enum class HorizontalCurveType
Members
Member name | Description
Unknown |  Unknown curve type, used in cases where the curve type cannot be determined.
Line |  Line curve type.
Arc |  Arc curve type.
Spiral |  Spiral curve type.
See Also
Autodesk.Revit.DB.Infrastructure Namespace